<?xml version="1.0" ?>
<net name="kws_ref_model_float32" version="11">
	<layers>
		<layer id="141" name="input_1" type="Parameter" version="opset1">
			<data shape="1,49,10,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input_1"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="input_1">
					<dim>1</dim>
					<dim>49</dim>
					<dim>10</dim>
					<dim>1</dim>
					<rt_info/>
				</port>
			</output>
		</layer>
		<layer id="0" name="Constant_1972023604" type="Const" version="opset1">
			<data offset="0" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="9179214039" type="Const" version="opset1">
			<data offset="16" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="2" name="9189223562" type="Const" version="opset1">
			<data offset="20" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="3" name="9199233997" type="Const" version="opset1">
			<data offset="16" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="9209243442" type="Const" version="opset1">
			<data offset="20" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="5" name="9079114030" type="Const" version="opset1">
			<data offset="24" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="6" name="9089124036" type="Const" version="opset1">
			<data offset="28" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="7" name="9099133589" type="Const" version="opset1">
			<data offset="24" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="8" name="9109143676" type="Const" version="opset1">
			<data offset="28" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="9" name="8678713595" type="Const" version="opset1">
			<data offset="32" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="10" name="8688723469" type="Const" version="opset1">
			<data offset="36" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="11" name="8698733556" type="Const" version="opset1">
			<data offset="32" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="12" name="8708743895" type="Const" version="opset1">
			<data offset="36" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="13" name="8478513883" type="Const" version="opset1">
			<data offset="40" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="14" name="8488523973" type="Const" version="opset1">
			<data offset="44" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="15" name="8498533724" type="Const" version="opset1">
			<data offset="40" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="16" name="8508543418" type="Const" version="opset1">
			<data offset="44" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="17" name="Constant_1441603628" type="Const" version="opset1">
			<data offset="0" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Identity59/FlattenONNX_/Reshape/shape1583793" type="Const" version="opset1">
			<data offset="48" size="16" shape="2" element_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Identity59/FlattenONNX_/Reshape/shape"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="5075113520" type="Const" version="opset1">
			<data offset="64" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="20" name="5085123730" type="Const" version="opset1">
			<data offset="68" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="21" name="5095133790" type="Const" version="opset1">
			<data offset="64" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="22" name="5105143820" type="Const" version="opset1">
			<data offset="68" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="23" name="4975013433" type="Const" version="opset1">
			<data offset="72" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="24" name="4985023838" type="Const" version="opset1">
			<data offset="76" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="25" name="4995033544" type="Const" version="opset1">
			<data offset="80" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="26" name="5005043733" type="Const" version="opset1">
			<data offset="84" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="27" name="const_fold_opt__1191543559" type="Const" version="opset1">
			<data offset="88" size="3072" shape="12,64" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="const_fold_opt__119"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__119">
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="functional_1/dense/BiasAdd/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="65535" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="const_fold_opt__1091523826" type="Const" version="opset1">
			<data offset="3160" size="16" shape="2" element_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="const_fold_opt__109"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="const_fold_opt__109">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="169717014090" type="Const" version="opset1">
			<data offset="3176" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="31" name="169817023736" type="Const" version="opset1">
			<data offset="3180" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="32" name="169917033901" type="Const" version="opset1">
			<data offset="3176" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="33" name="170017044003" type="Const" version="opset1">
			<data offset="3180" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="34" name="7477513499" type="Const" version="opset1">
			<data offset="3184" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="35" name="7487523787" type="Const" version="opset1">
			<data offset="3188" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="36" name="7497533850" type="Const" version="opset1">
			<data offset="3184" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="37" name="7507543613" type="Const" version="opset1">
			<data offset="3188" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="38" name="9779813529" type="Const" version="opset1">
			<data offset="3192" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="39" name="9789823958" type="Const" version="opset1">
			<data offset="3188" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="40" name="9799833760" type="Const" version="opset1">
			<data offset="3192" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="41" name="9809843982" type="Const" version="opset1">
			<data offset="3188" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="42" name="9679713754" type="Const" version="opset1">
			<data offset="3196" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="43" name="9689723946" type="Const" version="opset1">
			<data offset="3200" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="44" name="9699734057" type="Const" version="opset1">
			<data offset="3196" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="45" name="9709743874" type="Const" version="opset1">
			<data offset="3200" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="46" name="functional_1/conv2d_4/Conv2D_dequant1463976" type="Const" version="opset1">
			<data offset="3204" size="16384" shape="64,64,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="functional_1/conv2d_4/Conv2D_dequant"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="functional_1/conv2d_4/Conv2D_dequant">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="functional_1/activation_8/Relu;functional_1/batch_normalization_8/FusedBatchNormV3;functional_1/conv2d_4/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_4/BiasAdd;functional_1/conv2d_4/Conv2D1/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="65535" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="4774813586" type="Const" version="opset1">
			<data offset="19588" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="49" name="4784824021" type="Const" version="opset1">
			<data offset="19592" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="50" name="4794833703" type="Const" version="opset1">
			<data offset="19588" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="51" name="4804843532" type="Const" version="opset1">
			<data offset="19592" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="52" name="6576613649" type="Const" version="opset1">
			<data offset="19596" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="53" name="6586623937" type="Const" version="opset1">
			<data offset="19592" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="54" name="6596633409" type="Const" version="opset1">
			<data offset="19596" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="55" name="6606643673" type="Const" version="opset1">
			<data offset="19592" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="56" name="5775813496" type="Const" version="opset1">
			<data offset="19600" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="57" name="5785823598" type="Const" version="opset1">
			<data offset="19604" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="58" name="5795833601" type="Const" version="opset1">
			<data offset="19600" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="59" name="5805843862" type="Const" version="opset1">
			<data offset="19604" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="60" name="5375414075" type="Const" version="opset1">
			<data offset="19608" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="61" name="5385423994" type="Const" version="opset1">
			<data offset="19612" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="62" name="5395433436" type="Const" version="opset1">
			<data offset="19608" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="63" name="5405443970" type="Const" version="opset1">
			<data offset="19612" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="64" name="5275313667" type="Const" version="opset1">
			<data offset="19616" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="65" name="5285323865" type="Const" version="opset1">
			<data offset="19620" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="66" name="5295333616" type="Const" version="opset1">
			<data offset="19616" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="67" name="5305343403" type="Const" version="opset1">
			<data offset="19620" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="68" name="functional_1/conv2d_3/Conv2D_dequant1364096" type="Const" version="opset1">
			<data offset="19624" size="16384" shape="64,64,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="functional_1/conv2d_3/Conv2D_dequant"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="functional_1/conv2d_3/Conv2D_dequant">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="functional_1/activation_6/Relu;functional_1/batch_normalization_6/FusedBatchNormV3;functional_1/conv2d_3/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_3/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d_3/Conv2D1/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="65535" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="7877913700" type="Const" version="opset1">
			<data offset="36008" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="71" name="7887924045" type="Const" version="opset1">
			<data offset="36012" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="72" name="7897933490" type="Const" version="opset1">
			<data offset="36008" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="73" name="7907943832" type="Const" version="opset1">
			<data offset="36012" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="74" name="6876913538" type="Const" version="opset1">
			<data offset="36016" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="75" name="6886924078" type="Const" version="opset1">
			<data offset="36020" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="76" name="6896933451" type="Const" version="opset1">
			<data offset="36016" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="77" name="6906943439" type="Const" version="opset1">
			<data offset="36020" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="78" name="4074113763" type="Const" version="opset1">
			<data offset="36024" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="79" name="4084123769" type="Const" version="opset1">
			<data offset="36028" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="80" name="4094133607" type="Const" version="opset1">
			<data offset="36024" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="81" name="4104143907" type="Const" version="opset1">
			<data offset="36028" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="82" name="100710113991" type="Const" version="opset1">
			<data offset="36032" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="83" name="100810123679" type="Const" version="opset1">
			<data offset="36036" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="84" name="100910134054" type="Const" version="opset1">
			<data offset="36032" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="85" name="101010143718" type="Const" version="opset1">
			<data offset="36036" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="86" name="99710014066" type="Const" version="opset1">
			<data offset="36040" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="87" name="99810023505" type="Const" version="opset1">
			<data offset="36044" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="88" name="99910033919" type="Const" version="opset1">
			<data offset="36040" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="89" name="100010044087" type="Const" version="opset1">
			<data offset="36044" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="90" name="functional_1/conv2d_2/Conv2D_dequant1263706" type="Const" version="opset1">
			<data offset="36048" size="16384" shape="64,64,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="functional_1/conv2d_2/Conv2D_dequant"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="functional_1/conv2d_2/Conv2D_dequant">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="functional_1/activation_4/Relu;functional_1/batch_normalization_4/FusedBatchNormV3;functional_1/conv2d_2/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_2/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d_2/Conv2D1/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="65535" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="5976013415" type="Const" version="opset1">
			<data offset="52432" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="93" name="5986023625" type="Const" version="opset1">
			<data offset="52436" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="94" name="5996033658" type="Const" version="opset1">
			<data offset="52432" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="95" name="6006043985" type="Const" version="opset1">
			<data offset="52436" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="96" name="103710413841" type="Const" version="opset1">
			<data offset="52440" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="97" name="103810423424" type="Const" version="opset1">
			<data offset="52444" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="98" name="103910434042" type="Const" version="opset1">
			<data offset="52440" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="99" name="104010443727" type="Const" version="opset1">
			<data offset="52444" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="100" name="7077113568" type="Const" version="opset1">
			<data offset="52448" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="101" name="7087123796" type="Const" version="opset1">
			<data offset="52452" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="102" name="7097133799" type="Const" version="opset1">
			<data offset="52448" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="103" name="7107144060" type="Const" version="opset1">
			<data offset="52452" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="104" name="112711313979" type="Const" version="opset1">
			<data offset="52456" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="105" name="112811324027" type="Const" version="opset1">
			<data offset="52452" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="106" name="112911333565" type="Const" version="opset1">
			<data offset="52456" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="107" name="113011343526" type="Const" version="opset1">
			<data offset="52452" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="108" name="111711213631" type="Const" version="opset1">
			<data offset="52460" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="109" name="111811223547" type="Const" version="opset1">
			<data offset="52464" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="110" name="111911233583" type="Const" version="opset1">
			<data offset="52460" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="111" name="112011244033" type="Const" version="opset1">
			<data offset="52464" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="112" name="functional_1/conv2d_1/Conv2D_dequant1164000" type="Const" version="opset1">
			<data offset="52468" size="16384" shape="64,64,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="functional_1/conv2d_1/Conv2D_dequant"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="functional_1/conv2d_1/Conv2D_dequant">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;functional_1/conv2d_1/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D1/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="65535" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="7677713772" type="Const" version="opset1">
			<data offset="68852" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="115" name="7687723610" type="Const" version="opset1">
			<data offset="68856" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="116" name="7697733892" type="Const" version="opset1">
			<data offset="68852" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="117" name="7707744024" type="Const" version="opset1">
			<data offset="68856" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="118" name="106710713847" type="Const" version="opset1">
			<data offset="68860" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="119" name="106810724051" type="Const" version="opset1">
			<data offset="68856" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="120" name="106910733904" type="Const" version="opset1">
			<data offset="68860" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="121" name="107010743580" type="Const" version="opset1">
			<data offset="68856" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="122" name="5575613835" type="Const" version="opset1">
			<data offset="68864" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="123" name="5585624018" type="Const" version="opset1">
			<data offset="68868" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="124" name="5595633571" type="Const" version="opset1">
			<data offset="68864" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="125" name="5605643406" type="Const" version="opset1">
			<data offset="68868" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="126" name="109711013475" type="Const" version="opset1">
			<data offset="68872" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="127" name="109811023742" type="Const" version="opset1">
			<data offset="68868" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="128" name="109911034048" type="Const" version="opset1">
			<data offset="68872" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="129" name="110011043460" type="Const" version="opset1">
			<data offset="68868" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="130" name="108710913688" type="Const" version="opset1">
			<data offset="68876" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="131" name="108810923829" type="Const" version="opset1">
			<data offset="68880" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="132" name="108910933922" type="Const" version="opset1">
			<data offset="68876" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="133" name="109010943844" type="Const" version="opset1">
			<data offset="68880" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="134" name="functional_1/conv2d/Conv2D_dequant1064069" type="Const" version="opset1">
			<data offset="68884" size="10240" shape="64,1,10,4" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="functional_1/conv2d/Conv2D_dequant"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="functional_1/conv2d/Conv2D_dequant">
					<dim>64</dim>
					<dim>1</dim>
					<dim>10</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;functional_1/conv2d/BiasAdd/ReadVariableOp/resource;functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D1/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="65535" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>1</dim>
					<dim>10</dim>
					<dim>4</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>10</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="new_shape__1071043457" type="Const" version="opset1">
			<data offset="79124" size="32" shape="4" element_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="new_shape__107"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="new_shape__107">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="8378413592" type="Const" version="opset1">
			<data offset="79156" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="138" name="8388423811" type="Const" version="opset1">
			<data offset="79160" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="139" name="8398433448" type="Const" version="opset1">
			<data offset="79156" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="140" name="8408443487" type="Const" version="opset1">
			<data offset="79160" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="142" name="input_1/fq_output_0_0" type="FakeQuantize" version="opset1">
			<data levels="65536" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>49</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>49</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;functional_1/conv2d/BiasAdd/ReadVariableOp/resource;functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D1__45" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;functional_1/conv2d/BiasAdd/ReadVariableOp/resource;functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D1__45"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>49</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;functional_1/conv2d/BiasAdd/ReadVariableOp/resource;functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D1__45:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>49</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;functional_1/conv2d/BiasAdd/ReadVariableOp/resource;functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D1/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="4,1" pads_end="5,1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;functional_1/conv2d/BiasAdd/ReadVariableOp/resource;functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D1/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>49</dim>
					<dim>10</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>10</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;functional_1/conv2d/BiasAdd/ReadVariableOp/resource;functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D1/Dims5251083955" type="Const" version="opset1">
			<data offset="79164" size="256" shape="1,64,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;functional_1/conv2d/BiasAdd/ReadVariableOp/resource;functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D1/Dims525"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;functional_1/conv2d/BiasAdd/ReadVariableOp/resource;functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;functional_1/conv2d/BiasAdd/ReadVariableOp/resource;functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D1"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="147" name="functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;functional_1/conv2d/BiasAdd/ReadVariableOp/resource;functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D1/fq_output_0_0" type="FakeQuantize" version="opset1">
			<data levels="4294967296" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32" names="functional_1/activation/Relu;functional_1/batch_normalization/FusedBatchNormV3;functional_1/conv2d/BiasAdd/ReadVariableOp/resource;functional_1/conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d/Conv2D1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="148" name="Relu__5" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Relu__5"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="149" name="Relu__5/fq_output_0_0" type="FakeQuantize" version="opset1">
			<data levels="65536" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32" names="Relu__5:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="150" name="functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1/WithoutBiases/weights_shape28723931" type="Const" version="opset1">
			<data offset="79420" size="40" shape="5" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="151" name="105710613622" type="Const" version="opset1">
			<data offset="79460" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="152" name="105810623784" type="Const" version="opset1">
			<data offset="79464" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="153" name="105910633739" type="Const" version="opset1">
			<data offset="79460" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="154" name="106010643697" type="Const" version="opset1">
			<data offset="79464" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="155" name="const_fold_opt__1211113967" type="Const" version="opset1">
			<data offset="79468" size="2304" shape="64,1,3,3" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="const_fold_opt__121"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__121">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="156" name="functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="65535" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="157" name="2871" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="158" name="functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="159" name="functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1/Dims5131134099" type="Const" version="opset1">
			<data offset="81772" size="256" shape="1,64,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1/Dims513"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="160" name="functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="161" name="functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1/fq_output_0_0" type="FakeQuantize" version="opset1">
			<data levels="4294967296" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32" names="functional_1/activation_1/Relu;functional_1/batch_normalization_1/FusedBatchNormV3;functional_1/depthwise_conv2d/depthwise;functional_1/depthwise_conv2d/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/depthwise_conv2d/BiasAdd/ReadVariableOp/resource1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="162" name="Relu__8" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Relu__8"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="163" name="Relu__8/fq_output_0_0" type="FakeQuantize" version="opset1">
			<data levels="65536" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32" names="Relu__8:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="164" name="functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;functional_1/conv2d_1/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D1/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;functional_1/conv2d_1/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D1/WithoutBiases"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>25</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="165" name="functional_1/activation_2/Relu;functional_1/batch_normalization_2/FusedBatchNormV3;functional_1/conv2d_1/BiasAdd/ReadVariableOp/resource;functional_1/conv2d_1/BiasAdd;functional_1/conv2d_4/Conv2D;functional_1/conv2d_1/Conv2D1/Dims5371183721" type="Const" version="opset1">
			<data offset="82028" size="256" shape="1,64,1,1" element_type="f32"/>
			<rt_info>
