<?xml version="1.0" ?>
<net name="vww_96_float" version="11">
	<layers>
		<layer id="339" name="input_1" type="Parameter" version="opset1">
			<data shape="1,96,96,3" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input_1"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="input_1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<rt_info/>
				</port>
			</output>
		</layer>
		<layer id="0" name="Constant_3703827723" type="Const" version="opset1">
			<data offset="0" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="237123757987" type="Const" version="opset1">
			<data offset="16" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="2" name="237223768152" type="Const" version="opset1">
			<data offset="20" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="3" name="237323777582" type="Const" version="opset1">
			<data offset="16" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="237423787915" type="Const" version="opset1">
			<data offset="20" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="5" name="236123657600" type="Const" version="opset1">
			<data offset="24" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="6" name="236223667903" type="Const" version="opset1">
			<data offset="28" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="7" name="236323677663" type="Const" version="opset1">
			<data offset="24" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="8" name="236423687060" type="Const" version="opset1">
			<data offset="28" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="9" name="128112857504" type="Const" version="opset1">
			<data offset="32" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="10" name="128212867897" type="Const" version="opset1">
			<data offset="36" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="11" name="128312877219" type="Const" version="opset1">
			<data offset="32" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="12" name="128412888344" type="Const" version="opset1">
			<data offset="36" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="13" name="126112658239" type="Const" version="opset1">
			<data offset="40" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="14" name="126212668380" type="Const" version="opset1">
			<data offset="44" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="15" name="126312678407" type="Const" version="opset1">
			<data offset="40" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="16" name="126412687645" type="Const" version="opset1">
			<data offset="44" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="17" name="Constant_3173408308" type="Const" version="opset1">
			<data offset="0" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Identity119/FlattenONNX_/Reshape/shape3387246" type="Const" version="opset1">
			<data offset="48" size="16" shape="2" element_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Identity119/FlattenONNX_/Reshape/shape"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="205120557444" type="Const" version="opset1">
			<data offset="64" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="20" name="205220567120" type="Const" version="opset1">
			<data offset="68" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="21" name="205320578014" type="Const" version="opset1">
			<data offset="64" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="22" name="205420587450" type="Const" version="opset1">
			<data offset="68" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="23" name="204120458359" type="Const" version="opset1">
			<data offset="72" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="24" name="204220467063" type="Const" version="opset1">
			<data offset="76" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="25" name="204320477141" type="Const" version="opset1">
			<data offset="80" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="26" name="204420487165" type="Const" version="opset1">
			<data offset="84" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="27" name="const_fold_opt__2803347033" type="Const" version="opset1">
			<data offset="88" size="2048" shape="2,256" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="const_fold_opt__280"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__280">
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model/dense/MatMul;model/dense/BiasAdd/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="65535" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="const_fold_opt__2833327210" type="Const" version="opset1">
			<data offset="2136" size="16" shape="2" element_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="const_fold_opt__283"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="const_fold_opt__283">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="331733217765" type="Const" version="opset1">
			<data offset="2152" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="31" name="331833227111" type="Const" version="opset1">
			<data offset="2156" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="32" name="331933238203" type="Const" version="opset1">
			<data offset="2152" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="33" name="332033247108" type="Const" version="opset1">
			<data offset="2156" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="34" name="217121757168" type="Const" version="opset1">
			<data offset="2160" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="35" name="217221768257" type="Const" version="opset1">
			<data offset="2164" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="36" name="217321777072" type="Const" version="opset1">
			<data offset="2160" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="37" name="217421787795" type="Const" version="opset1">
			<data offset="2164" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="38" name="159115958296" type="Const" version="opset1">
			<data offset="2168" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="39" name="159215968437" type="Const" version="opset1">
			<data offset="2172" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="40" name="159315977780" type="Const" version="opset1">
			<data offset="2168" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="41" name="159415988038" type="Const" version="opset1">
			<data offset="2172" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="42" name="158115857474" type="Const" version="opset1">
			<data offset="2176" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="43" name="158215868074" type="Const" version="opset1">
			<data offset="2180" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="44" name="158315877729" type="Const" version="opset1">
			<data offset="2176" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="45" name="158415888236" type="Const" version="opset1">
			<data offset="2180" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="46" name="const_fold_opt__2773267486" type="Const" version="opset1">
			<data offset="2184" size="262144" shape="256,256,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="const_fold_opt__277"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__277">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="model/activation_26/Relu;model/batch_normalization_26/FusedBatchNormV3;model/conv2d_13/BiasAdd/ReadVariableOp/resource;model/conv2d_13/BiasAdd;model/conv2d_13/Conv2D1/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="65535" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="8518557465" type="Const" version="opset1">
			<data offset="264328" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="49" name="8528567576" type="Const" version="opset1">
			<data offset="264332" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="50" name="8538577642" type="Const" version="opset1">
			<data offset="264328" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="51" name="8548588284" type="Const" version="opset1">
			<data offset="264332" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="52" name="146114658413" type="Const" version="opset1">
			<data offset="264336" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="53" name="146214667438" type="Const" version="opset1">
			<data offset="264332" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="54" name="146314678008" type="Const" version="opset1">
			<data offset="264336" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="55" name="146414688269" type="Const" version="opset1">
			<data offset="264332" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="56" name="101110157012" type="Const" version="opset1">
			<data offset="264340" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="57" name="101210167447" type="Const" version="opset1">
			<data offset="264344" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="58" name="101310177948" type="Const" version="opset1">
			<data offset="264340" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="59" name="101410187258" type="Const" version="opset1">
			<data offset="264344" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="60" name="179117957849" type="Const" version="opset1">
			<data offset="264348" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="61" name="179217968224" type="Const" version="opset1">
			<data offset="264352" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="62" name="179317977552" type="Const" version="opset1">
			<data offset="264348" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="63" name="179417987069" type="Const" version="opset1">
			<data offset="264352" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="64" name="178117858356" type="Const" version="opset1">
			<data offset="264356" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="65" name="178217866994" type="Const" version="opset1">
			<data offset="264360" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="66" name="178317877702" type="Const" version="opset1">
			<data offset="264364" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="67" name="178417887687" type="Const" version="opset1">
			<data offset="264368" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="68" name="const_fold_opt__3123168350" type="Const" version="opset1">
			<data offset="264372" size="131072" shape="256,128,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="const_fold_opt__312"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__312">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="model/activation_24/Relu;model/batch_normalization_24/FusedBatchNormV3;model/conv2d_12/BiasAdd/ReadVariableOp/resource;model/conv2d_12/BiasAdd;model/conv2d_13/Conv2D;model/conv2d_12/Conv2D1/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="65535" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="212121257978" type="Const" version="opset1">
			<data offset="395444" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="71" name="212221267870" type="Const" version="opset1">
			<data offset="395448" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="72" name="212321278080" type="Const" version="opset1">
			<data offset="395444" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="73" name="212421286985" type="Const" version="opset1">
			<data offset="395448" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="74" name="111111157387" type="Const" version="opset1">
			<data offset="395452" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="75" name="111211167057" type="Const" version="opset1">
			<data offset="395448" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="76" name="111311177036" type="Const" version="opset1">
			<data offset="395452" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="77" name="111411187957" type="Const" version="opset1">
			<data offset="395448" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="78" name="9419457096" type="Const" version="opset1">
			<data offset="395456" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="79" name="9429468032" type="Const" version="opset1">
			<data offset="395460" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="80" name="9439478131" type="Const" version="opset1">
			<data offset="395456" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="81" name="9449487690" type="Const" version="opset1">
			<data offset="395460" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="82" name="7417457891" type="Const" version="opset1">
			<data offset="395464" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="83" name="7427467972" type="Const" version="opset1">
			<data offset="395460" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="84" name="7437477615" type="Const" version="opset1">
			<data offset="395464" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="85" name="7447486967" type="Const" version="opset1">
			<data offset="395460" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="86" name="7317358209" type="Const" version="opset1">
			<data offset="395468" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="87" name="7327366979" type="Const" version="opset1">
			<data offset="395472" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="88" name="7337377018" type="Const" version="opset1">
			<data offset="395468" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="89" name="7347387756" type="Const" version="opset1">
			<data offset="395472" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="90" name="const_fold_opt__3353067375" type="Const" version="opset1">
			<data offset="395476" size="65536" shape="128,128,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="const_fold_opt__335"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__335">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="model/activation_22/Relu;model/batch_normalization_22/FusedBatchNormV3;model/conv2d_11/BiasAdd/ReadVariableOp/resource;model/conv2d_11/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_11/Conv2D1/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="65535" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="229122957408" type="Const" version="opset1">
			<data offset="461012" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="93" name="229222967789" type="Const" version="opset1">
			<data offset="461016" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="94" name="229322977876" type="Const" version="opset1">
			<data offset="461012" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="95" name="229422987936" type="Const" version="opset1">
			<data offset="461016" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="96" name="153115357420" type="Const" version="opset1">
			<data offset="461020" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="97" name="153215367384" type="Const" version="opset1">
			<data offset="461016" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="98" name="153315377732" type="Const" version="opset1">
			<data offset="461020" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="99" name="153415387303" type="Const" version="opset1">
			<data offset="461016" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="100" name="150115058305" type="Const" version="opset1">
			<data offset="461024" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="101" name="150215067162" type="Const" version="opset1">
			<data offset="461028" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="102" name="150315077888" type="Const" version="opset1">
			<data offset="461024" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="103" name="150415087378" type="Const" version="opset1">
			<data offset="461028" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="104" name="131113157300" type="Const" version="opset1">
			<data offset="461032" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="105" name="131213167909" type="Const" version="opset1">
			<data offset="461036" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="106" name="131313177750" type="Const" version="opset1">
			<data offset="461032" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="107" name="131413187999" type="Const" version="opset1">
			<data offset="461036" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="108" name="130113057357" type="Const" version="opset1">
			<data offset="461040" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="109" name="130213067717" type="Const" version="opset1">
			<data offset="461044" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="110" name="130313077132" type="Const" version="opset1">
			<data offset="461040" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="111" name="130413087240" type="Const" version="opset1">
			<data offset="461044" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="112" name="const_fold_opt__2732966988" type="Const" version="opset1">
			<data offset="461048" size="65536" shape="128,128,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="const_fold_opt__273"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__273">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="model/activation_20/Relu;model/batch_normalization_20/FusedBatchNormV3;model/conv2d_10/BiasAdd/ReadVariableOp/resource;model/conv2d_10/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_10/Conv2D1/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="65535" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="174117457573" type="Const" version="opset1">
			<data offset="526584" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="115" name="174217468383" type="Const" version="opset1">
			<data offset="526588" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="116" name="174317478275" type="Const" version="opset1">
			<data offset="526584" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="117" name="174417488116" type="Const" version="opset1">
			<data offset="526588" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="118" name="9919957777" type="Const" version="opset1">
			<data offset="526592" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="119" name="9929968041" type="Const" version="opset1">
			<data offset="526588" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="120" name="9939977186" type="Const" version="opset1">
			<data offset="526592" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="121" name="9949987945" type="Const" version="opset1">
			<data offset="526588" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="122" name="8018057321" type="Const" version="opset1">
			<data offset="526596" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="123" name="8028067090" type="Const" version="opset1">
			<data offset="526600" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="124" name="8038077093" type="Const" version="opset1">
			<data offset="526596" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="125" name="8048088029" type="Const" version="opset1">
			<data offset="526600" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="126" name="187118758389" type="Const" version="opset1">
			<data offset="526604" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="127" name="187218768191" type="Const" version="opset1">
			<data offset="526608" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="128" name="187318778017" type="Const" version="opset1">
			<data offset="526604" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="129" name="187418788110" type="Const" version="opset1">
			<data offset="526608" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="130" name="186118657471" type="Const" version="opset1">
			<data offset="526612" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="131" name="186218667138" type="Const" version="opset1">
			<data offset="526616" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="132" name="186318677288" type="Const" version="opset1">
			<data offset="526612" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="133" name="186418687204" type="Const" version="opset1">
			<data offset="526616" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="134" name="const_fold_opt__2972867696" type="Const" version="opset1">
			<data offset="526620" size="65536" shape="128,128,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="const_fold_opt__297"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__297">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="model/activation_18/Relu;model/batch_normalization_18/FusedBatchNormV3;model/conv2d_9/BiasAdd/ReadVariableOp/resource;model/conv2d_9/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_9/Conv2D1/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="65535" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="235123557966" type="Const" version="opset1">
			<data offset="592156" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="137" name="235223567747" type="Const" version="opset1">
			<data offset="592160" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="138" name="235323577390" type="Const" version="opset1">
			<data offset="592156" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="139" name="235423588167" type="Const" version="opset1">
			<data offset="592160" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="140" name="120112057192" type="Const" version="opset1">
			<data offset="592164" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="141" name="120212067114" type="Const" version="opset1">
			<data offset="592160" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="142" name="120312078353" type="Const" version="opset1">
			<data offset="592164" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="143" name="120412088107" type="Const" version="opset1">
			<data offset="592160" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="144" name="192119257528" type="Const" version="opset1">
			<data offset="592168" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="145" name="192219268323" type="Const" version="opset1">
			<data offset="592172" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="146" name="192319277216" type="Const" version="opset1">
			<data offset="592168" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="147" name="192419288146" type="Const" version="opset1">
			<data offset="592172" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="148" name="114111457183" type="Const" version="opset1">
			<data offset="592176" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="149" name="114211467276" type="Const" version="opset1">
			<data offset="592172" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="150" name="114311477345" type="Const" version="opset1">
			<data offset="592176" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="151" name="114411488020" type="Const" version="opset1">
			<data offset="592172" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="152" name="113111357648" type="Const" version="opset1">
			<data offset="592180" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="153" name="113211368083" type="Const" version="opset1">
			<data offset="592184" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="154" name="113311377369" type="Const" version="opset1">
			<data offset="592180" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="155" name="113411388266" type="Const" version="opset1">
			<data offset="592184" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="156" name="const_fold_opt__2962767363" type="Const" version="opset1">
			<data offset="592188" size="65536" shape="128,128,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="const_fold_opt__296"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__296">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="157" name="model/activation_16/Relu;model/batch_normalization_16/FusedBatchNormV3;model/conv2d_8/BiasAdd/ReadVariableOp/resource;model/conv2d_8/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_8/Conv2D1/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="65535" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="158" name="176117658194" type="Const" version="opset1">
			<data offset="657724" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="159" name="176217667426" type="Const" version="opset1">
			<data offset="657728" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="160" name="176317677513" type="Const" version="opset1">
			<data offset="657724" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="161" name="176417687243" type="Const" version="opset1">
			<data offset="657728" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="162" name="224122457189" type="Const" version="opset1">
			<data offset="657732" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="163" name="224222467840" type="Const" version="opset1">
			<data offset="657728" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="164" name="224322478377" type="Const" version="opset1">
			<data offset="657732" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="165" name="224422487612" type="Const" version="opset1">
			<data offset="657728" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="166" name="9619657333" type="Const" version="opset1">
			<data offset="657736" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="167" name="9629667906" type="Const" version="opset1">
			<data offset="657740" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="168" name="9639677318" type="Const" version="opset1">
			<data offset="657736" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="169" name="9649687156" type="Const" version="opset1">
			<data offset="657740" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="170" name="210121057837" type="Const" version="opset1">
			<data offset="657744" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="171" name="210221067804" type="Const" version="opset1">
			<data offset="657748" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="172" name="210321077813" type="Const" version="opset1">
			<data offset="657744" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="173" name="210421088173" type="Const" version="opset1">
			<data offset="657748" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="174" name="209120957054" type="Const" version="opset1">
			<data offset="657752" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="175" name="209220968392" type="Const" version="opset1">
			<data offset="657756" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="176" name="209320977786" type="Const" version="opset1">
			<data offset="657752" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="177" name="209420987144" type="Const" version="opset1">
			<data offset="657756" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="178" name="const_fold_opt__3052668395" type="Const" version="opset1">
			<data offset="657760" size="65536" shape="128,128,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="const_fold_opt__305"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__305">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="179" name="model/activation_14/Relu;model/batch_normalization_14/FusedBatchNormV3;model/conv2d_7/BiasAdd/ReadVariableOp/resource;model/conv2d_7/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_7/Conv2D1/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="65535" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="180" name="7817857990" type="Const" version="opset1">
			<data offset="723296" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="181" name="7827867498" type="Const" version="opset1">
			<data offset="723300" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="182" name="7837877000" type="Const" version="opset1">
			<data offset="723296" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="183" name="7847888026" type="Const" version="opset1">
			<data offset="723300" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="184" name="8318357003" type="Const" version="opset1">
			<data offset="723304" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="185" name="8328367456" type="Const" version="opset1">
			<data offset="723308" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="186" name="8338377933" type="Const" version="opset1">
			<data offset="723304" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="187" name="8348388332" type="Const" version="opset1">
			<data offset="723308" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="188" name="231123157411" type="Const" version="opset1">
			<data offset="723312" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="189" name="231223167873" type="Const" version="opset1">
			<data offset="723316" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="190" name="231323177900" type="Const" version="opset1">
			<data offset="723312" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="191" name="231423187969" type="Const" version="opset1">
			<data offset="723316" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="192" name="9219257009" type="Const" version="opset1">
			<data offset="723320" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="193" name="9229267483" type="Const" version="opset1">
			<data offset="723316" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="194" name="9239278434" type="Const" version="opset1">
			<data offset="723320" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="195" name="9249287222" type="Const" version="opset1">
			<data offset="723316" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="196" name="9119157618" type="Const" version="opset1">
			<data offset="723324" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="197" name="9129168200" type="Const" version="opset1">
			<data offset="723328" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="198" name="9139177771" type="Const" version="opset1">
			<data offset="723324" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="199" name="9149188314" type="Const" version="opset1">
			<data offset="723328" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="200" name="const_fold_opt__3322567630" type="Const" version="opset1">
			<data offset="723332" size="32768" shape="128,64,1,1" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="const_fold_opt__332"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__332">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="201" name="model/activation_12/Relu;model/batch_normalization_12/FusedBatchNormV3;model/conv2d_6/BiasAdd/ReadVariableOp/resource;model/conv2d_6/BiasAdd;model/depthwise_conv2d_11/depthwise;model/conv2d_6/Conv2D1/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="65535" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="202" name="8718758086" type="Const" version="opset1">
			<data offset="756100" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="203" name="8728767522" type="Const" version="opset1">
			<data offset="756104" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="204" name="8738777315" type="Const" version="opset1">
			<data offset="756100" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="205" name="8748787123" type="Const" version="opset1">
			<data offset="756104" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="206" name="106110657549" type="Const" version="opset1">
			<data offset="756108" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="207" name="106210668101" type="Const" version="opset1">
			<data offset="756104" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="208" name="106310678140" type="Const" version="opset1">
			<data offset="756108" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="209" name="106410688428" type="Const" version="opset1">
			<data offset="756104" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
